SGLang_Data_20260615_dp2_sweep/sglang/sglang-oai_dp2_rr8_il2048_ol512.log
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32150, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=8.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/sglang/sglang-oai_dp2_rr8_il2048_ol512.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32150, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=8.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/sglang/sglang-oai_dp2_rr8_il2048_ol512.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 202736
#Output tokens: 52363
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    8.0       
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  30.30     
Total input tokens:                      202736    
Total input text tokens:                 202736    
Total input vision tokens:               0         
Total generated tokens:                  52363     
Total generated tokens (retokenized):    52363     
Request throughput (req/s):              6.60      
Input token throughput (tok/s):          6690.92   
Output token throughput (tok/s):         1728.14   
Peak output token throughput (tok/s):    2873.00   
Peak concurrent requests:                69        
Total token throughput (tok/s):          8419.07   
Concurrency:                             33.96     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   5144.25   
Median E2E Latency (ms):                 4843.30   
---------------Time to First Token----------------
Mean TTFT (ms):                          96.06     
Median TTFT (ms):                        93.71     
P99 TTFT (ms):                           182.21    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.37     
Median TPOT (ms):                        19.55     
P99 TPOT (ms):                           24.10     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           19.36     
Median ITL (ms):                         16.20     
P95 ITL (ms):                            47.54     
P99 ITL (ms):                            102.43    
Max ITL (ms):                            185.74    
==================================================